# Terraform `environment` `prod`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWE2ZTllZTdkLTJiNjUtNDFlMS1hZGZiLTBjOGMyMzUxNWNmOTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.altinncr_writer_corr_test will be created
  + resource "azurerm_role_assignment" "altinncr_writer_corr_test" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/content/write'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/content/read'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/metadata/read'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/metadata/write'})
             )
             OR 
             (
              @Request[Microsoft.ContainerRegistry/registries/repositories:name] StringStartsWith 'corr'
             )
            )
        EOT
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d3c35a12-5465-4ba3-b50d-8ab1bedbef2a"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Container Registry Repository Writer"
      + scope                            = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-prod/altinncr` |
| State File | `github.com/altinn/altinn-platform/environments/prod/altinncr.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_prod_altinncr.tfstate.tfplan` |